import React, { useEffect } from "react";
import axios from "axios";
import { HomeContainer } from "../Home/styles";
import { HeaderComponent } from "../Header/Header";
import { Paid, ParticipantsWrapper, TableRow } from "../Participants/styles";

type Participant = {
    name: string;
    birth: string;
    paid: boolean;
    distance: string;
    gender: string;
    team?: string;
};

export const RaceDay2026: React.FC = () => {
    return (
        <HomeContainer>
            <HeaderComponent video='http://www.osogovo.run/media/osogovo-run-21-sec-low.mp4' />
            <ParticipantsWrapper>
                <h1 >
                    Инструкции за състезателния ден на Osogovo Run!
                </h1>
                <div >
                    <p >Здравейте! Ето малко подробности за състезателния ден:</p>
                    <div >
                        <ul> 
                            <li>Стартовите пакети ще се раздават между 7:45 и 8:45 на площад Велбъжд, където е и стартът на състезанието. Моля, не идвайте в последния момент, а ако пътувате в същия ден, предвидете буферно време за пристигане, включително за паркиране. В неделя паркирането в центъра на Кюстендил е безплатно, но може да бъде затруднено.</li>
                            <li>Ще получите стартов пакет, стартов номер и безопасни игли за закрепянето му - моля, закрепете номера на видно място отпред. На пунктовете и финала доброволците ще попитат за Вашия номер, за да го отразят в системата за времеизмерване.</li>
                        </ul>
                    </div>
                    <p>Инструкции за времето, екипировката и багажа за финалите:</p>
                    <div>
                        <ul> 
                            <li>Прогнозата е за хладно време с умерен вятър на билото на планината. Участниците, особено на дългата дистанция, която излиза на алпийското било на планината, следва да бъдат подготвени за студено време.</li>
                            <li>Препоръчваме Ви да носите: <b>ветровка, шапка/бъф и ръкавици.</b> За дългата дистанция препоръчваме допълнително - дълъг клин/панталон, допълнителен шал/бъф, термо горнище с дълъг ръкав и други по Ваша преценка.</li>
                            <li>Подгответе раница с багаж на старта (или използвайте мешката от стартовия пакет), която да бъде транспортирана до Вашия финал, за да се преоблечете бързо. Участниците в дългата дистанция да предвидят подходящо облекло за връщането до ски-център Осогово (12 км обратно от върха), където ще е раздаването на медалите, награждаването и откъдето има осигурено извозване.</li>
                            <li>Доброволци ще Ви информират кой автомобил извозва багаж за Вашия финал. </li>
                        </ul>
                    </div>
                    <p >В случай че се откажете от участие по време на състезанието, моля, информирайте организаторите или доброволците на удобен за Вас пункт или се обадете на телефона, отбелязан на стартовия номер, ако имате нужда от съдействие.</p>
                    <p >Маркировка по трасето:</p>
                    <img src="https://pvmolqp98bhv9my7.public.blob.vercel-storage.com/270902.jpg" alt="Electric Fence Warning" style={{maxWidth: "50%", height: "auto"}} />
                    <div >
                        <ul> 
                            <li>Трасето ще бъде маркирано с цветни <span style={{color: "red"}}>червено</span>-бели ленти върху дървета или върху колчета в тревистите участъци. Освен това ще се използва временен <span style={{color: "green"}}>зелен</span> или <span style={{color: "orange"}}>оранжев</span> спрей. Найлоновите ленти ще бъдат почистени по най-бързия начин от организаторите след състезанието. Молим и участниците да не замърсяват трасето, като използват чувалите за отпадъци на пунктовете.</li>
                            <li>Обърнете внимание, че след първия пункт на Студен Кладенец има прескачане на ел. пастир</li>
                            <img src="https://pvmolqp98bhv9my7.public.blob.vercel-storage.com/270903.jpg" alt="Electric Fence Warning" style={{maxWidth: "50%", height: "auto", padding: "10px 0"}} />
                            <li>На асфалтовия път преди хижата маркировката е нарядко, поради липса на отклонения</li>
                            <li>От старта колоната с участници ще бъде изведена с помощта на полицейска кола през главните градски улици до стадион Осогово</li>
                            <li>Моля, следвайте маркировката или GPS трака и не се отклонявайте от обозначения маршрут. Ако загубите маркировката, върнете се до последната видяна маркировка и продължете от там или използвайте GPS трака за ориентация.</li>
                            <li>На открити места, особено на билото на планината, маркировката може да не се вижда отдалеч, поради липсата на дървета, така че се препоръчва да се оглеждате внимателно. Участъкът съвпада и с червено-бялата туристическа маркировка за връх Руен.</li>
                            <li>Свалете от сайта GPS трака за Вашата дистанция и го заредете във Вашето GPS устройство - часовник, телефон или друго: <a href="https://pvmolqp98bhv9my7.public.blob.vercel-storage.com/Osogovo_Run_14K_2025.gpx" target="_blank" rel="noopener noreferrer">Линк към GPS трак къса дистанция 14к</a> или <a href="https://pvmolqp98bhv9my7.public.blob.vercel-storage.com/Osogovo_Run_2025.gpx" target="_blank" rel="noopener noreferrer">Линк към GPS трак дълга дистанция 26к</a></li>
                        </ul>
                    </div>
                    <img src="https://pvmolqp98bhv9my7.public.blob.vercel-storage.com/270904.jpg" alt="Electric Fence Warning" style={{maxWidth: "50%", height: "auto"}} />


                    <p >Допълнителни инструкции за безопасност:</p>
                    <div >
                        <ul> 
                            <li>Върху стартовите номерата ще намерите изписан телефонен номер за спешни случаи, на които можете да се свържете със състезателния директор при необходимост.</li>
                            <li>Моля, носете зареден мобилен телефон. Тъй като сигналът в планината може да е слаб и зоната е гранична, за по-добро покритие активирайте Вашата роуминг услуга предварително. Препоръчваме да спрете мобилните данни (интернет), за да избегнете таксуване по тарифа извън ЕС и да използвате връзката само при необходимост.</li>
                            <li>На вр. Руен ще има екип на ПСС, който ще осигурява безопасността на участниците и при необходимост ще оказва помощ.</li>
                            <li>Ако видите друг участник в затруднение, опитайте се да помогнете и се свържете със съзтезателния директор или ПСС, или информирайте доброволците на следващия пункт.</li>
                            <li>Всички участници имат застраховка за времето от старта до контролното време на съответния финал.</li> 
                            <li>Молим участниците на дългата дистанция, които преценят, че няма да достигнат финала в контролното време да финишират на ски-център Осогово или да се върнат там, ако вече са го подминали. Продължаването извън контролното време е на лична отговорност.</li>
                            <li>Моля, спазвайте указанията на организаторите и доброволците по време на състезанието.</li>
                        </ul>
                    </div>
                    <img src="https://pvmolqp98bhv9my7.public.blob.vercel-storage.com/2709.jpg" alt="Electric Fence Warning" style={{maxWidth: "50%", height: "auto", padding: "10px 0"}} />
                    <p >Хранене и хидратация по трасето:</p>
                    <div >
                        <ul> 
                            <li>На всички пунктове ще има вода, кола, соли, енергийни барчета от Roobar, плодове и други сладки и солени неща. Препоръчваме за всеки случай да носите със себе си и допълнителна храна, барчета или енергийни гелове според личните предпочитания.</li>
                            <li>Препоръчваме Ви да носите лична бутилка за вода, която да зареждате на пунктовете и да използвате по време на бягането.</li>
                        </ul>
                    </div>
                    <p >Mедали, награждаване и извозване:</p>
                    <div >
                        <ul> 
                            <li>Всички медали и грамоти за завършване ще се получават на финала на ски-център Осогово. </li>
                            <li>Призьорите получават медали с мястото на класиране, а останалите участници идентичен медал с надпис "Finisher".</li>
                            <li>Награждаването ще се извършва на финала на ски-център Осогово при финиширане на трети състезател от съответната категория - жени, мъже, Ж20, М20, Ж40, М40.</li>
                            <li>Извозването от ски-център Осогово обратно до старта ще бъде осигурено от организаторите и ще започне на групи след 13 часа.</li>
                        </ul>
                    </div>
                    <p>Моля носете лична карта, особено на дългата дистанция, тъй като трасето навлиза в граничната зона!</p>
                </div>

            </ParticipantsWrapper>
        </HomeContainer>
    );
}

export default RaceDay2026;