import React, { useEffect } from "react";
import axios from "axios";
import { HomeContainer } from "../Home/styles";
import { HeaderComponent } from "../Header/Header";
import { Paid, ParticipantsWrapper, TableRow } from "../Participants/styles";

type Participant = {
    name: string;
    birth: string;
    paid: boolean;
    distance: string;
    gender: string;
    team?: string;
};

export const RaceDay: React.FC = () => {
    return (
        <HomeContainer>
            <HeaderComponent video='http://www.osogovo.run/media/osogovo-run-21-sec-low.mp4' />
            <ParticipantsWrapper>
                <h1 >
                    Инструкции за състезателния ден на Osogovo Run!
                </h1>
                <div >
                    <p >Здравейте! Ето малко подробности за състезателния ден:</p>
                    <div >
                        <ul> 
                            <li>Стартовите пакети ще се раздават между 7:45 и 8:45 на площад Велбъжд, където е и стартът на състезанието. Моля, не идвайте в последния момент, а ако пътувате в същия ден, предвидете буферно време за пристигане, включително за паркиране. В неделя паркирането в центъра на Кюстендил е безплатно, но може да бъде затруднено (провежда се и Празник на плодородието).</li>
                            <li> Ще получите стартов пакет, стартов номер и безопасни игли за закрепянето му - моля, закрепете номера на видно място. На пунктовете и финала доброволците ще попитат за Вашия номер, за да го отразят в системата за времеизмерване.</li>
                        </ul>
                    </div>
                    <p >Инструкции за екипировката, багажа и възможно лошо време:</p>
                    <div >
                        <ul> 
                            <li>Прогнозата засега е за хладно време с възможни кратки превалявания и лек вятър. Участниците, особено на дългата дистанция, която излиза на алпийското било на планината, следва да бъдат подготвени за променливи условия.</li>
                            <li>Препоръчваме Ви да носите подходяща екипировка за хладно и дъждовно време и обувки за бягане с добро сцепление и дълбок грайфер. Препоръчваме да носите допълнителни дрехи или аксесоари - например ветровка/мембрана, шапка/бъф, ръкавици, дреха с дълъг ръкав и други по Ваша преценка.</li>
                            <li>Подгответе раница/торба с багаж на старта, който да бъде транспортиран до съответния финал, за да се преоблечете бързо. Участниците в дългата дистанция да предвидят подходящо облекло за връщането до ски-център Осогово (12 км обратно от върха), където ще е раздаването на медалите, награждаването и откъдето има осигурено извозване.</li>
                            <li>Доброволци ще Ви информират кой автомобил извозва багаж за Вашия финал. Напомняме, че участниците в дългата дистанция може да финишират на късата, ако не се чувстват подготвени да продължат - имайте предвид, че в такъв случай ще трябва да изчакате слизането на автомобила с багажа от върха.</li>
                            <li><span style={{fontWeight: "900", textDecoration: "underline"}}>Важно за дългата дистанция (26 км):</span> В случай на значително влошаване на времето са възможни промени в маршрута на дългата дистанция, които ще бъдат обявени на място. Алтернативният маршрут предвижда достигане до Бег Бунар и финал на ски-център Осогово за участниците на дългата дистанция.</li>
                        </ul>
                    </div>
                    <p >Маркировка по трасето:</p>
                    <div >
                        <ul> 
                            <li>Трасето ще бъде маркирано с цветни <span style={{color: "red"}}>червено</span>-бели ленти и временен <span style={{color: "green"}}>зелен</span> спрей. Найлоновите ленти ще бъдат почистени по най-бързия начин от организаторите след състезанието. Молим и участниците да не замърсяват трасето, като използват чувалите за отпадъци на пунктовете.</li>
                            <li>От старта колоната с участници ще бъде изведена с помощта на полицейска кола през главните градски улици до стадион Осогово</li>
                            <li>Моля, следвайте маркировката и не се отклонявайте от обозначения маршрут. Ако загубите маркировката, върнете се до последната видяна маркировка и продължете от там.</li>
                            <li>На някои места, особено на билото след Бег Бунар (заслон Превала), маркировката може да не се вижда отдалеч, поради липсата на дървета, затова се оглеждайте внимателно. Участъкът съвпада и с червено-бялата туристическа маркировка за връх Руен.</li>
                            <li>Свалете от сайта GPS трака за Вашата дистанция и го заредете във Вашето GPS устройство - часовник, телефон или друго.</li>
                        </ul>
                    </div>
                    <p >Допълнителни инструкции за безопасност:</p>
                    <div >
                        <ul> 
                            <li>Върху стартовите номерата ще намерите изписани телефонни номера за спешни случаи, на които можете да се обадите при необходимост.</li>
                            <li>Моля, носете зареден мобилен телефон. Тъй като сигналът в планината може да е слаб и зоната е гранична, за по-добро покритие активирайте Вашата роуминг услуга предварително. Препоръчваме да спрете мобилните данни (интернет), за да избегнете таксуване по тарифа извън ЕС и да използвате връзката само при необходимост.</li>
                            <li>На вр. Руен ще има екип на ПСС, който ще осигурява безопасността на участниците и при необходимост ще оказва помощ.</li>
                            <li>Ако видите друг участник в затруднение, опитайте се да помогнете и се свържете със съзтезателния директор или ПСС, или информирайте доброволците на следващия пункт.</li>
                            <li>Всички участници имат застраховка за времето от старта до контролното време на съответния финал.</li> 
                            <li>Молим участниците на дългата дистанция, които преценят, че няма да достигнат финала в контролното време да финишират на ски-център Осогово или да се върнат там, ако вече са го подминали. Продължаването извън контролното време е на лична отговорност.</li>
                            <li>Моля, спазвайте указанията на организаторите и доброволците по време на състезанието.</li>
                        </ul>
                    </div>
                    <p >Хранене и хидратация по трасето:</p>
                    <div >
                        <ul> 
                            <li>На всички пунктове ще има вода, соли, енергийни барчета от Roobar, плодове и други сладки и солени неща. Препоръчваме за всеки случай да носите със себе си и допълнителна храна, барчета или енергийни гелове според личните предпочитания.</li>
                            <li>Препоръчваме Ви да носите лична бутилка за вода, която да зареждате на пунктовете и да използвате по време на бягането.</li>
                        </ul>
                    </div>
                    <p >Mедали, награждаване и извозване:</p>
                    <div >
                        <ul> 
                            <li>Всички медали и грамоти за завършване ще се получават на финала на ски-център Осогово. </li>
                            <li>Призьорите получават медали с мястото на класиране, а останалите участници идентичен медал с надпис "Finisher".</li>
                            <li>Награждаването ще се извършва на финала на ски-център Осогово при финиширане на трети състезател от съответната категория - жени, мъже, Ж20, М20, Ж40, М40.</li>
                            <li>Допълнително чрез томбола ще се раздадат два наградни ваучера от GoRun shop, като ще бъде изтеглен по един завършил участник от двете дистанции. В случай че той отсъства, ваучерът ще бъде изпратен по имейл.</li>
                            <li>Извозването от ски-център Осогово обратно до старта ще бъде осигурено от организаторите и ще започне на групи след 13 часа.</li>
                        </ul>
                    </div>
                    <p>Моля носете лична карта, тъй като трасето навлиза в граничната зона!</p>
                </div>

            </ParticipantsWrapper>
        </HomeContainer>
    );
}

export default RaceDay;